#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda.data.external.archive_prepare[0]: Reading...
module.lambda.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.lambda.local_file.archive_plan[0]: Refreshing state... [id=125cf8e3add4dd1404bc0e52f1c218291ac48cff]
module.lambda.null_resource.archive[0]: Refreshing state... [id=9000425994783071604]
module.lambda.null_resource.sam_metadata_aws_lambda_function[0]: Refreshing state... [id=1975803061767454497]
module.lambda.data.aws_region.current: Reading...
module.lambda.data.aws_caller_identity.current: Reading...
module.lambda.data.aws_partition.current: Reading...
module.lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=epdri6w9g3]
module.lambda.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/pillow-lambda]
module.lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lambda.aws_iam_role.lambda[0]: Refreshing state... [id=pillow-lambda]
module.lambda.data.aws_caller_identity.current: Read complete after 0s [id=575302032415]
module.lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3936985939]
module.lambda.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::575302032415:policy/pillow-lambda-logs]
module.lambda.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=pillow-lambda-20231120114504124300000002]
aws_iam_role_policy.lambda_policy: Refreshing state... [id=pillow-lambda:terraform-20231120114503660300000001]
module.lambda.aws_lambda_function.this[0]: Refreshing state... [id=pillow-lambda]
module.lambda.aws_lambda_permission.current_version_triggers["APIGatewayAny"]: Refreshing state... [id=APIGatewayAny]
module.lambda.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"]: Refreshing state... [id=APIGatewayAny]
module.api_gateway.aws_apigatewayv2_integration.this["GET /"]: Refreshing state... [id=x3upo0i]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.api_gateway.aws_apigatewayv2_route.this["GET /"]: Refreshing state... [id=27t92ah]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a3a39406426373040289ef2c31155b7e905bf72bb6754fcc50e414cf9d5d6744.zip" -> "builds/c9ec0f4adab56b0d7ee4a0ca90f861d905de047080314b7012473639fc1049dc.zip"
        id                             = "pillow-lambda"
      ~ last_modified                  = "2023-11-24T14:18:29.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:575302032415:function:pillow-lambda:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:575302032415:function:pillow-lambda:11/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pillow-lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:execute-api:us-west-2:575302032415:epdri6w9g3/*/*"
      + statement_id        = "APIGatewayAny"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "pip",
                      + "python3.10",
                      + "./src/requirements.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./src/",
                      + null,
                    ],
                ]
              + filename      = "builds/c9ec0f4adab56b0d7ee4a0ca90f861d905de047080314b7012473639fc1049dc.zip"
              + runtime       = "python3.10"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/c9ec0f4adab56b0d7ee4a0ca90f861d905de047080314b7012473639fc1049dc.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9000425994783071604" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a3a39406426373040289ef2c31155b7e905bf72bb6754fcc50e414cf9d5d6744.zip" -> "builds/c9ec0f4adab56b0d7ee4a0ca90f861d905de047080314b7012473639fc1049dc.zip"
          ~ "timestamp" = "1700835496429996000" -> "1700835751553010000"
        }
    }

  # module.lambda.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1975803061767454497" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/a3a39406426373040289ef2c31155b7e905bf72bb6754fcc50e414cf9d5d6744.zip" -> "builds/c9ec0f4adab56b0d7ee4a0ca90f861d905de047080314b7012473639fc1049dc.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 4 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @elonniu, Action: `pull_request`, Working Directory: ``, Workflow: `Demo4 PR Workflow`*